# Создание Django project

# Создать новый проект в PyCharm

# Создать новое виртуальное окружение

# Установить Django

# Создать проект `django-admin startproject itg .`
# Этой командой мы создадим проект с именем `itg` в текущей директории.
# Точка в конце команды означает, что проект будет создан в текущей директории, 
# без создания дополнительной директории с именем проекта.
# itg — просто название проекта, которое мы создали.

# Проверить работу приложения по адресу 127.0.0.1:8000

# Создать приложение `python manage.py startapp news`
# После создания приложения, вам нужно зарегистрировать его в файле `settings.py` в разделе `INSTALLED_APPS`

# Создать первое представление
# Чтобы представление заработало, его нужно зарегистрировать в файле `urls.py` конфигурации проекта.

# Создать первый URL

# Проверить работу приложения по адресу 127.0.0.1:8000