# Игра: Угадай число
#
# За основу возьмите свой код, разработанный в предыдущем проектном уроке, посвященном Game Hub (урок 13).
# Если в тот раз вы не реализовали весь функционал, то сначала реализуйте полностью игру, а затем переходите
# к рефакторингу на основе заданий из этого урока.
#
# Рефакторинг
# - Добавить логирование действий (попыток пользователя) с использованием модуля `datetime`.
# В файл записывается время начало игры, время и значение каждой попытки, время окончания игры и результат.
# - Добавить обработку ошибок с использованием `try/except`, где это необходимо.