# Игра: Викторина
#
# За основу возьмите свой код, разработанный в предыдущем проектном уроке, посвященном Game Hub (урок 13).
# Если в тот раз вы не реализовали весь функционал, то сначала реализуйте полностью игру, а затем переходите
# к рефакторингу на основе заданий из этого урока.
#
# Рефакторинг
# - Добавить загрузку вопросов и ответов из файла JSON.
# - Добавить обработку ошибок с использованием `try/except`, где это необходимо.
# - Добавить необходимость указания имени и фамилии перед прохождением теста.
# - По итогу теста должен создаваться текстовый файл, где должно быть указано:
#     - Имя и фамилия испытуемого.
#     - Время начала и окончания теста.
#     - Общее количество вопросов, количество правильных ответов, процент выполнения теста.
#     - Все тестовые вопросы, ответы пользователя на них, правильные ответы и указание,
#     ответил пользователь правильно или нет (True, False)