# 1. Получить все статьи, которые принадлежат категории "Технологии"
# 2. Получить все статьи, которые имеют тег "Инновации"
# 3. Получить все статьи, отсортированные по дате публикации в порядке убывания
# 4. Получить все статьи, у которых количество просмотров больше 10, отсортированные по количеству просмотров в порядке возрастания
# 5. Получить все статьи, у которых содержание содержит слово "кошки"
# 6. Получить все статьи, опубликованные в октябре 2023 года
# 7. Получить все статьи, опубликованные в 2023 году
# 8. Получить все статьи, у которых есть хотя бы один тег
# 9. Получить все статьи, у которых количество тегов больше 3
# 10. Получить все статьи, у которых контент содержит слово "ученые"
# 11. Добавить slug в Article
# 12. Создать представлние (views.py) использующее slug
# 13. Создать маршрут (urls.py) ссылающийся на этот slug
# 14. Создать пользовательский менеджер модели выводящий статьи в обратном алфавитном порядке