# Задача 1:
# Получите список всех статей и их категорий.

# Задача 2:
# Получите список всех статей и их тегов.

# Задача 3:
# Получите список всех статей, которые не имеют категории.

# Задача 4:
# Получите список всех статей, которые не имеют тегов.

# Задача 5:
# Получите список всех категорий и связанных с ними статей.

# Задача 6:
# Получите список всех тегов и связанных с ними статей.

# Задача 7:
# Получите список всех статей, которые содержат слово "пауки" в заголовке или содержании.

# Задача 8*:
# Получите список всех статей с их тегами (теги для каждой строки нужно свернуть в одну ячейку),
# которые были опубликованы в 2023 году.
# ПОДСКАЗКА: гуглите функцию STRING_AGG()

# Задача 9:
# Получите список всех статей, которые имеют более 120 просмотров и были опубликованы НЕ в 2023 году.

# Задача 10:
# Получите список всех статей, которые принадлежат к категории "Наука" или "Технологии".

# Задача 11:
# Получите список всех статей, которые имеют тег НЕ "Здоровье" и не "Ученые" и при этом имеют меньше 200 просмотров.

# Задача 12:
# Получите список всех статей, которые не имеют категории и не содержат слова "городе" и "довольны" в содержании.

#####
# Задача 13:
# Вывести все статьи, опубликованные в октябре 2023 года.

# Задача 14:
# Найти категории, у которых среднее количество просмотров статей больше 200.

# Задача 15:
# Получить список всех категорий и количество статей в каждой категории.

# Задача 16:
# Найти статьи, которые принадлежат категории "Технологии" или "Наука".

# Задача 17:
# Найти категории, у которых максимальное количество просмотров статьи больше 300.

# Задача 18:
# Получить список всех тегов и количество статей, связанных с каждым тегом.

# Задача 19:
# Найти статьи, которые не принадлежат ни одной категории.

# Задача 20:
# Вывести статьи, у которых заголовок содержит слово "летающие".

# Задача 21:
# Получить список всех статей и их категорий, отсортированных по количеству просмотров в порядке убывания.

# Задача 22:
# Найти теги, у которых сумма просмотров статей больше 1000.

# Задача 23:
# Получить список всех статей и их тегов, отсортированных по дате публикации.

# Задача 24:
# Найти статьи, которые принадлежат категории "Спорт" и имеют тег "Футбол".