# Тема: Итераторы и генераторы. Функции-генераторы. Выражения-генераторы
# Покажите в режиме live-coding и объясните:
# - Создание и использование итератора
# - Создание и использование функции-генератора
# - Создание и использование выражения-генератора












# Тема: Генераторы и встроенные функции
# Покажите в режиме live-coding и объясните:
# - Использование генератора вместе с встроенными функциями list, set, min, max, sum.
# - Использование генератора вместе с циклом for.











# Тема: Генераторы и файлы
# Покажите в режиме live-coding и объясните:
# - Чтение файлов построчно через генераторы
# - Чтение файлов по частям через генераторы
# - Фильтрацию с файлами через генераторы





