# Задача 1: Найти все статьи, которые были опубликованы после 31 октября 2023 года. (70 строк)
# .filter()

# Задача 2: Найти все статьи, которые принадлежат категории "Образование" и имеют тег "Инновации". (3 строки)
# Q(), .filter()

# Задача 3: Найти все статьи, которые не принадлежат категории "Культура". (86 строк)
# Q(), .filter()

# Задача 4: Найти все статьи, которые принадлежат категории "Здоровье" или "Образование" и имеют тег "Исследования". (6 строк)
# Q(), .filter()

# Задача 5: Увеличить количество просмотров всех статей на 5.
# F(), .update()

# Задача 6: Аннотировать все статьи с константным значением `is_featured` равным `False`.
# .annotate()

# Задача 7: Найти все статьи, которые были опубликованы в 2023 году. (92 строки)
# .filter()

# Задача 8: Найти все статьи, которые принадлежат категории "Технологии" и имеют тег "Инновации". (5 строк)
# Q(), .filter()

# Задача 9: Подсчитать количество статей в каждой категории.
# .values(), .annotate(), Count()

# Задача 10: Подсчитать суммарное количество просмотров всех статей.
# .aggregate(), Sum()

# Задача 11: Найти статьи, у которых количество просмотров больше 150. (примерно 98 строк)
# .filter()

# Задача 12: Найти статьи, у которых количество просмотров меньше или равно 200. (примерно 20 строк)
# .filter()