# 1. переделать ArticleForm с Form на ModelForm
# 2. добавить в модели данных Article поле для хранения картинок
# 3. добавить каталог для хранения картинок и прописать его в settings.py
# 4. добавить формы для удаления и редактирования новостей
# 5. добавить представления для удаления и редактирования новостей
# 6. добавить маршруты для удаления и редактирования новостей
# 7. добавить шаблоны для удаления и редактирования новостей
# 8. добавить возможность прикрепления картинки в форме ArticleForm
# 9. добавить отобржение картинки в article_detail.html