### Список задач. Каждую нужно решить на SQL и Django ORM

# 1. Выбрать все статьи из категории "Технологии" и получить их заголовки и количество просмотров.
# 2. Выбрать все статьи, у которых количество просмотров больше 200, и получить их заголовки и даты публикации.
# 3. Выбрать все статьи, у которых количество просмотров больше 100 и меньше 300, и получить их заголовки и количество просмотров.
# 4*. Выбрать все статьи, у которых количество просмотров больше 200, и получить их заголовки и названия категорий.
# 5*. Выбрать все статьи из категории "Технологии" или "Наука" и получить их заголовки и названия категорий.
# 6. Выбрать все статьи, у которых количество просмотров больше 200, и отсортировать их по дате публикации в порядке убывания, получить их заголовки и даты публикации.
# 7. Выбрать все статьи, у которых количество просмотров больше 200, и отсортировать их по количеству просмотров в порядке убывания, получить их заголовки и количество просмотров.
# 8. Выбрать все статьи, у которых количество просмотров меньше 300, и отсортировать их по категории и дате публикации, получить их заголовки и даты публикации.
# 9. Выбрать все статьи, у которых количество просмотров больше или равно 200, и отсортировать их по категории в порядке возрастания и дате публикации в порядке убывания, получить их заголовки и даты публикации.
# 10. Выбрать все статьи, у которых количество просмотров между 220 и 270, и отсортировать их по категории в порядке убывания и дате публикации в порядке возрастания, получить их заголовки и даты публикации.
# 11. Выбрать все статьи, у которых количество просмотров не больше 200, и отсортировать их по категории и количеству просмотров в порядке убывания, получить их заголовки и количество просмотров.
# 12. Выбрать все статьи, у которых количество просмотров больше 300 и меньше 200, и отсортировать их по категории в порядке возрастания и количеству просмотров в порядке убывания, получить их заголовки и количество просмотров.