# Тема: map, filter, zip

# Задача 1: Применение функции map для преобразования чисел
# Напишите функцию `square`, которая принимает число и возвращает его квадрат.
# Используйте функцию `map`, чтобы применить эту функцию к списку чисел `[1, 2, 3, 4, 5]` и выведите результат.
#
# numbers = [1, 2, 3, 4, 5]
# # Ожидаемый результат: [1, 4, 9, 16, 25]
# def square(x):
#     return x*x
# squared_numbers = map(square,numbers)
# print(list(squared_numbers))

# Задача 2: Применение функции filter для отбора четных чисел
# Напишите функцию `is_even`, которая принимает число и возвращает `True`, если число четное,
# и `False` в противном случае. Используйте функцию `filter`, чтобы отобрать четные числа из
# списка `[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]` и выведите результат.
#
# numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# # Ожидаемый результат: [2, 4, 6, 8, 10]
# def is_even(x):
#     return x % 2 == 0
#
# even_numbers = filter(is_even, numbers)
# print(list(even_numbers))

# Задача 3: Применение функции zip для объединения списков
# У вас есть два списка: `names = ["Alice", "Bob", "Charlie"]` и `ages = [25, 30, 35]`.
# Используйте функцию `zip`, чтобы создать список кортежей, где каждый кортеж содержит имя и возраст,
# и выведите результат.

# names = ["Alice", "Bob", "Charlie"]
# ages = [25, 30, 35]
# # Ожидаемый результат: [("Alice", 25), ("Bob", 30), ("Charlie", 35)]
# combined = zip(names, ages)
# print(list(combined))

# Задача 4: Применение функции map для преобразования строк в числа
# Напишите функцию `to_int`, которая принимает строку и возвращает ее
# преобразование в целое число.
# Используйте функцию `map`, чтобы применить эту функцию к
# списку строк `["1", "2", "3", "4", "5"]`
# и выведите результат.
#
# str_numbers = ["1", "2", "3", "4", "5"]
# # Ожидаемый результат: [1, 2, 3, 4, 5]
# def to_int(x):
#     return int(x)
#
# numbers = ["1", "2", "3", "4", "5"]
# result = list(map(to_int, numbers))
#
# print(result)

# Задача 5: Применение функции filter для отбора слов длиннее 3 символов
# Напишите функцию `longer_than_three`, которая принимает строку и возвращает `True`,
# если длина строки больше 3 символов, и `False` в противном случае. Используйте функцию `filter`,
# чтобы отобрать слова длиной больше 3 символов из списка `["apple", "kiwi", "banana", "pear"]` и выведите результат.
#
# words = ["apple", "kiwi", "banana", "pear"]
# # Ожидаемый результат: ["apple", "banana", "pear"]
# def longer_than_three(x):
#    return len(x) > 4
# long_word = filter(longer_than_three, words)
# print(list(long_word))

