# Тема: Вложенные циклы: for вложенный в for, for вложенный в while.
# Покажите и объясните использования вложенных циклов в формате live-coding.









# Тема: Генераторы списков (List comprehension). Вложенные циклы и вложенные генераторы списков.
# Продемонстрируйте и объясните использование генераторов списков.
# В том числе использование вложенных генераторов списков.









# Тема: Итератор и итерируемые объекты. Функции iter и next. Сравнение iter и next с циклом for и функцией range.
# Продемонстрируйте создание итератора и использование функций iter и next.
