# Тема: Логические операторы: and, or, not

# Мини проект: Калькулятор
# Создайте простой калькулятор, который может выполнять основные арифметические операции:
# сложение, вычитание, умножение и деление.
#
# Требования:
# Программа должна запрашивать у пользователя два числа и операцию (+, -, *, /).
# Программа должна выполнять выбранную операцию и выводить результат, например:
# "Результат вычисления 2 + 3 равен 5"
# # В противном случае вывести сообщение: "Ввод не может быть обработан".
#
# a = int(input("Enter A: "))
# b = int(input("Enter B: "))
# action = input("Enter your action")
# result = ""
# if action == "+":
#     result = a + b
# elif action == "-":
#     result = a - b
# elif action == "*":
#     result = a * b
# elif action ==  "/":
#     result = a / b
# print(f"Результат вычисления {a} {action} {b} = {result}")
