# Тема: Вложенные условия и множественный выбор. Тернарный оператор

# Задание 1: Определите, принадлежит ли число 14 интервалу от 10 до 20 включительно.
# Выведите соответствующее сообщение: "Число принадлежит интервалу от 10 до 20", "Число больше 20", "Число меньше 10".
# a = 14
# if a > 20:
#     print("Число больше 20")
# elif a > 10:
#     print("Число принадлежит интервалу от 10 до 20")
# else:
#     print("Число меньше 10")
# Задание 2: Проверьте, является ли строка пустой или начинается с пробела.
# Выведите соответствующее сообщение: "Строка пустая", "Строка начинается с пробела", "Строка не начинается с пробела".
# text = " example"
# first_sym = text[0]
# if text == "":
#     print("Строка пустая")
# elif first_sym == " ":
#     print("Строка начинается с пробела")
# else:
#     print("Строка не начинается с пробела")
# Задание 3: Определите размер скидки и выведите ее размер в консоль.
# Если покупка стоит до 10 долларов, то скидки нет, если до 50, то скидка 10%, если больше 50, то 15%.
# my_sum = 68
# if my_sum > 50:
#     print("Your Discount is 15%")
# elif my_sum < 50:
#     print("Your discount is 10%")
# else:
#     print("You have not discount")
# Задание 4: Проверьте длину пароля и выведите соответствующее сообщение:
# до 8 символов "Короткий пароль", до 16 символов "Средний пароль", больше "Длинный пароль"
# password = "Привет"
# pass_lenth = len(password)
# if pass_lenth > 16:
#     print("You have a long password")
# elif pass_lenth > 8:
#     print("You have not bad password")
# else:
#     print("You have a short password")
# Задание 5: Проверьте, содержит ли строка символ '@'.
# Если да, то выведите сообщение "Это email", если нет, то "Введите email".
# Проверить наличие символа в строке можно так: <символ> in <строка>
# str1 = "1@2.com"
# if "@" in str1:
#     print("This is email")
# else:
#     print("Введите email")
# Задание 6: Определите, является ли число положительным или отрицательным с помощью тернарного оператора.
# num = -10
# is_positive = True if num % 2 == 0 else False
# Задание 7: Проверьте, четное или нечетное число с помощью тернарного оператора.
# num = 7
# if num % 2 == 0:
#     print("четное число")
# else:
#     print("нечетное")
# Задание 8: Определите, является ли строка пустой или нет с помощью тернарного оператора.
# text = "Hello"
# is_positive = True if text == "" else False
# Задание 9: Проверьте, начинается ли строка с заглавной буквы с помощью тернарного оператора.
# city = "Berlin"
# first_sym = city[0]
# is_positive = True if first_sym == first_sym.upper() else False





