# Задача 1:
# Получите список всех статей и их категорий.

# Задача 2:
# Получите список всех статей и их тегов.

# Задача 3:
# Получите список всех статей, которые не имеют категории.

# Задача 4:
# Получите список всех статей, которые не имеют тегов.

# Задача 5:
# Получите список всех категорий и связанных с ними статей.

# Задача 6:
# Получите список всех тегов и связанных с ними статей.

# Задача 7:
# Получите список всех статей, которые содержат слово "пауки" в заголовке или содержании.

# Задача 8*:
# Получите список всех статей с их тегами (теги для каждой строки нужно свернуть в одну ячейку),
# которые были опубликованы в 2023 году.
# ПОДСКАЗКА: гуглите функцию STRING_AGG()

# Задача 9:
# Получите список всех статей, которые имеют более 120 просмотров и были опубликованы НЕ в 2023 году.

# Задача 10:
# Получите список всех статей, которые принадлежат к категории "Наука" или "Технологии".

# Задача 11:
# Получите список всех статей, которые имеют тег НЕ "Здоровье" и не "Ученые" и при этом имеют меньше 200 просмотров.

# Задача 12:
# Получите список всех статей, которые не имеют категории и не содержат слова "городе" и "довольны" в содержании.