# Напишите запросы на языке SQL

# 1. Создание новой категории
# Например:
# Создайте новую категорию с именем "Путешествия".

# 2. Создание новой статьи
# Например
# Создайте новую статью с
#     заголовком "Путешествие в Исландию",
#     содержанием "Исландия — удивительная страна с вулканами и гейзерами.",
#     датой публикации "2023-10-15T12:00:00Z",
#     количеством просмотров 100,
#     категорией "Путешествия" и
#     активным статусом.

# 3. Выборка всех статей
# Например:
# Выберите все статьи из категории "Технологии".

# 4. Выборка всех активных статей

# 5. Обновление заголовка статьи
# Например:
# Обновите заголовок статьи с id 1 на "Новый заголовок".

# 6: Увеличение количества просмотров статьи
# Например:
# Увеличьте количество просмотров статьи с id 2 на 50.

# 7. Удаление статьи
# Например:
# Удалите статью с id 73

# 8. Создание нового тега
# Например:
# Создайте новый тег с именем "Путешествия".

# 9. Добавление тега к статье
# Например:
# Добавьте тег "Путешествия" к статье с id 21.

# 10. Выборка всех статей с определенным тегом
# Например:
# Выберите все статьи, которые имеют тег "Путешествия".

# 11. Удаление тега из статьи
# Например:
# Удалите тег "Путешествия" из статьи с id 21.


# Напишите запросы на языке Django ORM

# 12. Создание новой категории
# Например:
# Создайте новую категорию с именем "Путешествия".

# 13. Создание новой статьи
# Например
# Создайте новую статью с
#     заголовком "Путешествие в Исландию",
#     содержанием "Исландия — удивительная страна с вулканами и гейзерами.",
#     датой публикации "2023-10-15T12:00:00Z",
#     количеством просмотров 100,
#     категорией "Путешествия" и
#     активным статусом.

# 14. Выборка всех статей
# Например:
# Выберите все статьи из категории "Технологии".

# 15. Выборка всех активных статей

# 16. Обновление заголовка статьи
# Например:
# Обновите заголовок статьи с id 1 на "Новый заголовок".

# 17: Увеличение количества просмотров статьи
# Например:
# Увеличьте количество просмотров статьи с id 2 на 50.

# 18. Удаление статьи
# Например:
# Удалите статью с id 73

# 19. Создание нового тега
# Например:
# Создайте новый тег с именем "Путешествия".

# 20. Добавление тега к статье
# Например:
# Добавьте тег "Путешествия" к статье с id 21.

# 21. Выборка всех статей с определенным тегом
# Например:
# Выберите все статьи, которые имеют тег "Путешествия".

# 22. Удаление тега из статьи
# Например:
# Удалите тег "Путешествия" из статьи с id 21.